In [1]:
import pandas as pd
import numpy as np


pd.set_option('display.max_columns', None)

import warnings
warnings.simplefilter('ignore')

In [2]:
df=pd.read_csv('ufo.csv', encoding='latin1')

df.head()

,datetime,duration_in_secs,country,city,shape,coordinates,coordinates_area_51,coordinates_palo_verde_nuclear_generating_station,distance_in _km_from_palo_verde_ngs,distance_in _km_from_a51
0,2014-05-01 21:00:00,2700.0,us,los angeles,light,"(34.0522222, -118.2427778)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",502,416
1,2014-04-30 21:10:00,60.0,us,las vegas,light,"(36.175, -115.1363889)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",372,132
2,2014-04-24 20:00:00,240.0,us,phoenix,circle,"(33.4483333, -112.07333329999999)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",73,540
3,2014-04-23 20:30:00,300.0,us,phoenix,circle,"(33.4483333, -112.07333329999999)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",73,540
4,2014-04-20 22:50:00,5.0,us,seattle,formation,"(47.6063889, -122.33083329999998)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",1768,1270

In [3]:
df.shape

(2070, 10)

In [4]:
df['duration_in_secs']=df['duration_in_secs'].astype(int)

In [13]:
df.dropna(subset=['datetime'])

,datetime,duration_in_secs,country,city,shape,coordinates,coordinates_area_51,coordinates_palo_verde_nuclear_generating_station,distance_in _km_from_palo_verde_ngs,distance_in _km_from_a51
0,2014-05-01 21:00:00,2700,us,los angeles,light,"(34.0522222, -118.2427778)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",502,416
1,2014-04-30 21:10:00,60,us,las vegas,light,"(36.175, -115.1363889)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",372,132
2,2014-04-24 20:00:00,240,us,phoenix,circle,"(33.4483333, -112.07333329999999)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",73,540
3,2014-04-23 20:30:00,300,us,phoenix,circle,"(33.4483333, -112.07333329999999)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",73,540
4,2014-04-20 22:50:00,5,us,seattle,formation,"(47.6063889, -122.33083329999998)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",1768,1270
...,...,...,...,...,...,...,...,...,...,...
2052,1954-07-01 22:00:00,15,us,los angeles,circle,"(34.0522222, -118.2427778)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",502,416
2053,1953-04-15 12:00:00,5,us,los angeles,fireball,"(34.0522222, -118.2427778)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",502,416
2054,1951-02-15 11:00:00,2700,us,los angeles,disk,"(34.0522222, -118.2427778)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",502,416
2055,1949-04-10 15:00:00,600,us,seattle,disk,"(47.6063889, -122.33083329999998)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",1768,1270
2056,1947-07-04 17:30:00,10,us,seattle,oval,"(47.6063889, -122.33083329999998)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",1768,1270

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2070 entries, 0 to 2069
Data columns (total 10 columns):
 #   Column                                             Non-Null Count  Dtype
---  ------                                             --------------  -----
 0   datetime                                           2057 non-null   object
 1   duration_in_secs                                   2070 non-null   int64
 2   country                                            2070 non-null   object
 3   city                                               2070 non-null   object
 4   shape                                              2070 non-null   object
 5   coordinates                                        2070 non-null   object
 6   coordinates_area_51                                2070 non-null   object
 7   coordinates_palo_verde_nuclear_generating_station  2070 non-null   object
 8   distance_in _km_from_palo_verde_ngs                2070 non-null   int64
 9   distance_in _km_from_a51                           2070 non-null   int64
dtypes: int64(3), object(7)
memory usage: 161.8+ KB

In [15]:
import mysql.connector as conn

In [19]:
crea_db=conn.connect(host='localhost', user='root', passwd='x')

In [20]:
cursor=crea_db.cursor()

In [6]:
def crear_db(nombre, user='root', password='x', check=True):
    
    crea_db=conn.connect(host='localhost', user=user, passwd=password)

    cursor=crea_db.cursor()

    cursor.execute(f'drop database if exists {nombre}')
    cursor.execute(f'create database {nombre}')
    
    print('Hecho, base de datos creada. ;)')
    
    if check:
        cursor.execute('show databases')
        for x in cursor:
            print(x)

In [7]:
def crear_tabla_desde_df(df, nombre_tabla, nombre_db, user='root', password='x', check=True, drop=False):
    
    db=conn.connect(host='localhost', user=user, passwd=password, database=nombre_db)
    cursor=db.cursor()
    
    if drop:
        cursor.execute(f'drop table if exists {nombre_tabla}')
    
    tabla=f"create table {nombre_tabla}(id int, {' varchar(200),'.join(df.columns)} varchar(200));"
    print(tabla)
    
    cursor.execute(tabla)
    
    print(f'Hecho, tabla {nombre_tabla} creada. ;)')
    
    if check:
        cursor.execute('show tables')
        for x in cursor:
            print(x)

In [8]:
def insertar_datos(df, nombre_tabla, nombre_db, user='root', password='x', check=True):
    
    db=conn.connect(host='localhost', user=user, passwd=password, database=nombre_db)
    cursor=db.cursor()
    
    for i in range(len(df)):
    
        insert_query='insert into {} (id, {}) values {};'\
                     .format(nombre_tabla, ','.join(df.columns), tuple(np.insert(df.iloc[i].values, 0, i)))

        cursor.execute(insert_query)

    db.commit()
    
    print(f'Hecho, datos dentro de tabla {nombre_tabla}. ;)')
    print()
    print(insert_query)

In [9]:
def leer_sql(query, nombre_tabla, nombre_db, user='root', password='x'):
    
    db=conn.connect(host='localhost', user=user, passwd=password, database=nombre_db)
    
    data=pd.read_sql(query, db)
    
    return data

In [23]:
crear_db('ufos')

Hecho, base de datos creada. ;)
('information_schema',)
('mydb',)
('mysql',)
('performance_schema',)
('proyectosharks',)
('publication',)
('sakila',)
('sharks',)
('sys',)
('ufos',)
('world',)

In [24]:
db=conn.connect(host='localhost', user='root', passwd='Vdpsvdps1', database='ufos')

cursor=db.cursor()

In [16]:
df.columns

Index(['datetime', 'duration_in_secs', 'country', 'city', 'shape',
       'coordinates', 'coordinates_area_51',
       'coordinates_palo_verde_nuclear_generating_station',
       'distance_in _km_from_palo_verde_ngs', 'distance_in _km_from_a51'],
      dtype='object')

In [30]:
cursor.execute('drop table if exists ufo_sighting')   # borra la tabla si existe



tabla='''
        create table ufos(
            
            id int,
            datetime varchar(500),
            duration_in_secs int,
            country varchar(500),
            city varchar(500),
            shape varchar(500),
            coordinates varchar(500),
            coordinates_area_51 varchar(500),
            coordinates_palo_verde_nuclear_generating_station varchar(500),
            distance_in_km_from_palo_verde_ngs varchar(500),
            distance_in_km_from_a51 varchar(500)
             

        );
'''


cursor.execute(tabla)

In [31]:
cursor.execute('show tables')
for x in cursor:
    print(x)

('ufos',)

In [32]:
for i in range(len(df)):
    
    
    insert_query='insert into {} ({}) values {};'\
                    .format('ufos', ','.join(df.columns), tuple(df.iloc[i].values))
    
    cursor.execute(insert_query)
    
db.commit()

ProgrammingError: 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '_km_from_palo_verde_ngs,distance_in _km_from_a51) values ('2014-05-01 21:00:00',' at line 1